// ============================================================================
// 
// ちょちょいと自動更新全体で使う関数
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 
// ----------------------------------------------------------------------------

using Shinta;

using System;

namespace Updater.Misc
{
	public class UpdaterCommon
	{
		// ====================================================================
		// public メンバー関数
		// ====================================================================

		// --------------------------------------------------------------------
		// 通知対象ウィンドウに、UI を表示したことを通知（1 度だけ）
		// --------------------------------------------------------------------
		public static void NotifyDisplayedIfNeeded(UpdaterLauncher oParams)
		{
			if (smNotified || oParams.NotifyHWnd == IntPtr.Zero)
			{
				return;
			}

			// 通知
			smNotified = true;
			WindowsApi.PostMessage(oParams.NotifyHWnd, UpdaterLauncher.WM_UPDATER_UI_DISPLAYED, (IntPtr)0, (IntPtr)0);
		}

		// ====================================================================
		// private 定数
		// ====================================================================

		// ====================================================================
		// private メンバー変数
		// ====================================================================

		private static Boolean smNotified = false;


	}
	// public class UpdaterCommon ___END___
}
// namespace Updater.Misc ___END___

